1. Какие типы паттернов проектирования существуют?

Порождающие
-----------
Для создания объектов. Так как часто создание объектов через __construct приводит в потенциальным и не только ошибкам.
А так же усложняет логику.
Порождающие паттерны позволяют инкапсулировать логику создания объектов.


Структурные
-----------
Эти шаблоны в основном посвящены компоновке объектов. Как построить программный компонент?



Поведенческие
-------------
Поведенческие шаблоны проектирования определяют алгоритмы и способы реализации взаимодействия различных объектов и классов.
Они обеспечивают гибкость взаимодействия между объектами.
